app/Controllers/Admin.php

public function news()
{
    $model = new NewsModel();
    $data['news'] = $model->findAll();
---
SELECT *
FROM `news`

public function save_news()
    {
        $model = new NewsModel();

    $validationRules = [
        'title' => 'required|min_length[3]',
        'date' => 'required|valid_date',
        'content' => 'required',
        'image' => 'uploaded[image]|max_size[image,1024]|is_image[image]',
    ];

    if (!$this->validate($validationRules)) {
        return redirect()->to('/admin/news')->withInput()->with('validation', $this->validator);
    }

    // Handle image upload
    $image = $this->request->getFile('image');
    $newName = $image->getRandomName();
    $image->move('path/to/upload/directory', $newName);

    // Save news data to the database
    $data = [
        'title' => $this->request->getPost('title'),
        'date' => $this->request->getPost('date'),
        'content' => $this->request->getPost('content'),
        'image' => $newName,
    ];

    $model->insert($data);
---
INSERT INTO `news` (`title`, `date`, `content`, `image`) VALUES ('hvjhj', '2024-01-28', '<p>hbvjhb j</p>', '1706181764_2817f38d0e9c532ddef3.jpg')